Revit 2027 API
BuiltInFailures.WallJoinRoofFailures.NoFromRoofForWall Property
 Highlighted wall is set to be "From roof", however there is no roof below it that can be used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoFromRoofForWall { get; }
Public Shared ReadOnly Property NoFromRoofForWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoFromRoofForWall {
	FailureDefinitionId^ get ();
}
static member NoFromRoofForWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallJoinRoofFailures Class
Autodesk.Revit.DB Namespace